In [29]:
#MULTI - LEVEL INDEXING

In [30]:
import numpy as np
import pandas as pd

In [31]:
from numpy.random import randn

In [32]:
np.random.seed(101)

In [33]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [34]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [35]:
df

             A         B
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

In [36]:
df.index.names = ['Groups','Num']

In [37]:
df

                   A         B
Groups Num
G1     1    2.706850  0.628133
       2    0.907969  0.503826
       3    0.651118 -0.319318
G2     1   -0.848077  0.605965
       2   -2.018168  0.740122
       3    0.528813 -0.589001

In [38]:
#TO EXTRACT VALUE AT G1,2,B

In [39]:
val = df.loc['G1'].loc[2]['B']

In [40]:
val

0.5038257538223936

In [41]:
#TO EXTRACT VALUE AT G2,1,A

In [42]:
val2 = df.loc['G2'].loc[1]['A']

In [43]:
val2

-0.8480769834036315

In [44]:
df

                   A         B
Groups Num
G1     1    2.706850  0.628133
       2    0.907969  0.503826
       3    0.651118 -0.319318
G2     1   -0.848077  0.605965
       2   -2.018168  0.740122
       3    0.528813 -0.589001

In [45]:
val_1 = [df.loc['G1'].loc[1],df.loc['G2'].loc[1]]

In [47]:
for i in val_1:
    print(i)

A    2.706850
B    0.628133
Name: 1, dtype: float64
A   -0.848077
B    0.605965
Name: 1, dtype: float64

In [48]:
#CROSS SECTION FUNCTION

In [50]:
val_G1 = df.xs('G1')

In [51]:
val_G1

            A         B
Num
1    2.706850  0.628133
2    0.907969  0.503826
3    0.651118 -0.319318

In [52]:
df

                   A         B
Groups Num
G1     1    2.706850  0.628133
       2    0.907969  0.503826
       3    0.651118 -0.319318
G2     1   -0.848077  0.605965
       2   -2.018168  0.740122
       3    0.528813 -0.589001

In [53]:
df.xs(1,level = 'Num')

               A         B
Groups
G1      2.706850  0.628133
G2     -0.848077  0.605965

#END